{
  "timestamp": "2025-11-15T19:07:31.691490+00:00",
  "source": "Hacker News",
  "learnings": [
    {
      "title": "Linux on the Fujitsu Lifebook U729",
      "url": "https://borretti.me/article/linux-on-the-fujitsu-lifebook-u729",
      "score": 113,
      "source": "Hacker News",
      "content": "This post describes my experience using Linux on the Fujitsu Lifebook U729 . The tl;dr is that it’s a delightful laptop, and Linux runs flawlessly, and all the hardware things I’ve needed run OOTB. The only difficulty I had was in disabling Secure Boot, but I figured out how to do it, which I explain below. Contents Background Troubleshooting Secure Boot Spyware Non-Problems BIOS Notes Links Background From early 2024 my daily driver was an M2 MacBook Air, until earlier this year I broke the screen, and the repair was quoted at almost 1000 AUD. Since I used it as a desktop most of the time, this didn’t affect me much. After some flip-flopping I decided to get an M4 Mac mini. Partly for the faster CPU and more RAM, but partly because I liked the idea of LARPing like it’s the 2000s, when computers, and by extension the Internet, where fixed in physical space, rather than following everyone around. Of course this was a terrible idea. I had three working computers—a Linux+Windows desktop, a Mac Mini, and a MacBook Air that I could use as a desktop—and none of them were portable. When I went to RustForge 2025 I just brought my phone. If I wanted to travel, even within Sydney, to a demo night or math club or some such, I didn’t have a laptop to bring with me. So I needed a new laptop. And the Tahoe release of macOS was so ugly (see e.g. 1 , 2 , 3 ) it made me boot up the old Linux desktop, and start playing around with NixOS again. And I fell in love with Linux again: with the tinkering and the experimentation and the freedom it affords you. So, I wanted a Linux laptop. I had a ThinkPad X1 some years ago and it was terribly: flimsy plastic build and hardware that vastly underperformed its price. I looked around for old, refursbished workstation laptops, and, randomly, I ran into an eBay seller offering a refurbished Fujitsu laptop. The specs/price ratio was pretty good: 16 GiB of RAM and 512GiB of SSD, all for 250 AUD. And it was 12in and 1.1kg, which I like: laptops shou\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "TCP, the workhorse of the internet",
      "url": "https://cefboud.com/posts/tcp-deep-dive-internals/",
      "score": 221,
      "source": "Hacker News",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "AI World Clocks",
      "url": "https://clocks.brianmoore.com/",
      "score": 1255,
      "source": "Hacker News",
      "content": "? × About AI World Clocks Every minute, a new clock is displayed that has been generated by nine different AI models. Each model is allowed 2000 tokens to generate its clock. Here is its prompt: Create HTML/CSS of an analog clock showing ${time}. Include numbers (or numerals) if you wish, and have a CSS animated second hand. Make it responsive and use a white background. Return ONLY the HTML/CSS code with no markdown formatting. Created by Brian Moore . You can also follow him on Instagram . Idea inspired by Matthew Rayfield . AI World Clocks Loading... Generating AI Clocks...",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Messing with scraper bots",
      "url": "https://herman.bearblog.dev/messing-with-bots/",
      "score": 146,
      "source": "Hacker News",
      "content": "Messing with bots 13 Nov, 2025 As outlined in my previous two posts : scrapers are, inadvertently, DDoSing public websites. I've received a number of emails from people running small web services and blogs seeking advice on how to protect themselves. This post isn't about that. This post is about fighting back. When I published my last post, there was an interesting write-up doing the rounds about a guy who set up a Markov chain babbler to feed the scrapers endless streams of generated data. The idea here is that these crawlers are voracious, and if given a constant supply of junk data, they will continue consuming it forever, while (hopefully) not abusing your actual web server. This is a pretty neat idea, so I dove down the rabbit hole and learnt about Markov chains, and even picked up Rust in the process. I ended up building my own babbler that could be trained on any text data, and would generate realistic looking content based on that data. Now, the AI scrapers are actually not the worst of the bots. The real enemy, at least to me, are the bots that scrape with malicious intent. I get hundreds of thousands of requests for things like .env , .aws , and all the different .php paths that could potentially signal a misconfigured Wordpress instance. These people are the real baddies. Generally I just block these requests with a 403 response. But since they want .php files, why don't I give them what they want? I trained my Markov chain on a few hundred .php files, and set it to generate. The responses certainly look like php at a glance, but on closer inspection they're obviously fake. I set it up to run on an isolated project of mine, while incrementally increasing the size of the generated php files from 2kb to 10mb just to test the waters. Here's a sample 1kb output: ' . $errmsg_generic . ' '; } /** * Fires at the end of the new user account registration form. * * @since 3.0.0 * * @param WP_Error $errors A WP_Error object containing ' user_name ' or ' user_email \n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "One Handed Keyboard",
      "url": "https://github.com/htx-studio/One-Handed-Keyboard",
      "score": 113,
      "source": "Hacker News",
      "content": "htx-studio / One-Handed-Keyboard Public Notifications You must be signed in to change notification settings Fork 73 Star 934 License MIT license 934 stars 73 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings htx-studio/One-Handed-Keyboard About No description, website, or topics provided. Resources Readme License MIT license Uh oh! There was an error while loading. Please reload this page . Activity Stars 934 stars Watchers 16 watching Forks 73 forks Report repository Releases No releases published Packages 0 No packages published",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Designing a Language (2017",
      "url": "https://cs.lmu.edu/~ray/notes/languagedesignnotes/",
      "score": 145,
      "source": "Hacker News",
      "content": "Language Design So, you want to design your own language? Of course you do. Or perhaps you are taking a class and are being forced to create a programming language under penalty of a bad grade. What kinds of things do you need to know? Designing a Language Of course you want to design (and implement!) your own programming language! It’s fun. It’s creative. It’s empowering. How do we do it? In a nutshell, the process is iterative, cycling between four phases: Doing the phases over and over is important; for example, while writing the compiler, you may be like “woah this is impossible” and then realize “oh shoot this part of the language wasn’t designed right!” Prerequisites It helps to be experienced. If you’re not, that’s okay, actually—you might get lucky! But don’t mistake creativity for luck that shows up without pre-existing knowledge. The most creative people are those with a lot of knowledge and experience. So you should still study and practice! Your success as a language designer will be massively aided by knowledge in three main areas: Programming Paradigms . You should know a number of different ways that computations can be structured. These include: imperative declarative structured object-oriented functional applicative concatenative logic protocol-oriented aspect-oriented array event-driven dataflow agent-based etc. See Wikipedia’s list of programming paradigms . Programming Language Concepts . You should have a good sense of most, if not all, of the following things: Sequencing, conditional execution, iteration, recursion, functional decomposition, modularity, synchronization, metaprogramming, binding, scope, extent, volatility, subtyping, pattern matching, type inference, closures, prototypes, introspection, instrumentation, annotations, decorators, memoization, traits, streams, monads, actors, mailboxes, comprehensions, continuations, wildcards, promises, regular expressions, proxies, transactional memory, inheritance, polymorphism, parameter modes,\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Lawmakers want to ban VPNs",
      "url": "https://www.eff.org/deeplinks/2025/11/lawmakers-want-ban-vpns-and-they-have-no-idea-what-theyre-doing",
      "score": 498,
      "source": "Hacker News",
      "content": "Remember when you thought age verification laws couldn't get any worse ? Well, lawmakers in Wisconsin , Michigan , and beyond are about to blow you away. It's unfortunately no longer enough to force websites to check your government-issued ID before you can access certain content, because politicians have now discovered that people are using Virtual Private Networks (VPNs) to protect their privacy and bypass these invasive laws. Their solution? Entirely ban the use of VPNs. Yes, really. As of this writing, Wisconsin lawmakers are escalating their war on privacy by targeting VPNs in the name of “protecting children” in A.B. 105 / S.B. 130 . It’s an age verification bill that requires all websites distributing material that could conceivably be deemed “sexual content” to both implement an age verification system and also to block the access of users connected via VPN. The bill seeks to broadly expand the definition of materials that are “harmful to minors” beyond the type of speech that states can prohibit minors from accessing—potentially encompassing things like depictions and discussions of human anatomy, sexuality, and reproduction. This follows a notable pattern: As we’ve explained previously , lawmakers, prosecutors, and activists in conservative states have worked for years to aggressively expand the definition of “harmful to minors” to censor a broad swath of content: diverse educational materials , sex education resources , art, and even award-winning literature . Wisconsin’s bill has already passed the State Assembly and is now moving through the Senate. If it becomes law, Wisconsin could become the first state where using a VPN to access certain content is banned. Michigan lawmakers have proposed similar legislation that did not move through its legislature, but among other things, would force internet providers to actively monitor and block VPN connections. And in the UK, officials are calling VPNs \"a loophole that needs closing.\" This is actually happenin\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "A new Google model is nearly perfect on automated handwriting recognition",
      "url": "https://generativehistory.substack.com/p/has-google-quietly-solved-two-of",
      "score": 438,
      "source": "Hacker News",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Unofficial Microsoft Teams client for Linux",
      "url": "https://github.com/IsmaelMartinez/teams-for-linux",
      "score": 234,
      "source": "Hacker News",
      "content": "IsmaelMartinez / teams-for-linux Public Uh oh! There was an error while loading. Please reload this page . Notifications You must be signed in to change notification settings Fork 299 Star 4k Unofficial Microsoft Teams for Linux client License GPL-3.0 license 4k stars 299 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings IsmaelMartinez/teams-for-linux About Unofficial Microsoft Teams for Linux client Topics electron microsoft linux teams Resources Readme License GPL-3.0 license Code of conduct Code of conduct Contributing Contributing Security policy Security policy Uh oh! There was an error while loading. Please reload this page . Activity Stars 4k stars Watchers 55 watching Forks 299 forks Report repository Releases 295 2.6.12 Latest Nov 7, 2025 + 294 releases Sponsor this project Uh oh! There was an error while loading. Please reload this page . paypal.me/ismaelmartinezramos ko-fi.com/ ismaelmartinezramos Learn more about GitHub Sponsors Packages 0 No packages published Uh oh! There was an error while loading. Please reload this page . Contributors 109 + 95 contributors Languages JavaScript 76.7% CSS 16.0% HTML 4.8% TypeScript 2.5%",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Go's Sweet 16",
      "url": "https://go.dev/blog/16years",
      "score": 232,
      "source": "Hacker News",
      "content": "The Go Blog Go’s Sweet 16 Austin Clements, for the Go team 14 November 2025 This past Monday, November 10th, we celebrated the 16th anniversary of Go’s open source release ! We released Go 1.24 in February and Go 1.25 in August , following our now well-established and dependable release cadence. Continuing our mission to build the most productive language platform for building production systems, these releases included new APIs for building robust and reliable software, significant advances in Go’s track record for building secure software, and some serious under-the-hood improvements. Meanwhile, no one can ignore the seismic shifts in our industry brought by generative AI. The Go team is applying its thoughtful and uncompromising mindset to the problems and opportunities of this dynamic space, working to bring Go’s production-ready approach to building robust AI integrations, products, agents, and infrastructure. Core language and library improvements First released in Go 1.24 as an experiment and then graduated in Go 1.25, the new testing/synctest package significantly simplifies writing tests for concurrent, asynchronous code . Such code is particularly common in network services, and is traditionally very hard to test well. The synctest package works by virtualizing time itself. It takes tests that used to be slow, flaky, or both, and makes them easy to rewrite into reliable and nearly instantaneous tests, often with just a couple extra lines of code. It’s also a great example of Go’s integrated approach to software development: behind an almost trivial API, the synctest package hides a deep integration with the Go runtime and other parts of the standard library. This isn’t the only boost the testing package got over the past year. The new testing.B.Loop API is both easier to use than the original testing.B.N API and addresses many of the traditional—and often invisible!— pitfalls of writing Go benchmarks. The testing package also has new APIs that make it easy\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "No One Lives Forever' turns 25 and you still can't buy it legitimately",
      "url": "https://www.techdirt.com/2025/11/13/no-one-lives-forever-turns-25-you-still-cant-buy-it-legitimately/",
      "score": 325,
      "source": "Hacker News",
      "content": "Arianity (profile) says: November 13, 2025 at 8:24 pm Maybe we’ll be able to play this game legitimately by the time Bobby Bonilla stops making his million and change per year. Ahh, a refreshing bit of optimism in these dark times!",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "SSL Configuration Generator",
      "url": "https://ssl-config.mozilla.org/",
      "score": 221,
      "source": "Hacker News",
      "content": "moz://a SSL Configuration Generator SSL Config Generator Server Software Apache AWS ALB AWS ELB Caddy Coturn Dovecot Exim Go HAProxy Jetty lighttpd MySQL nginx Oracle HTTP Postfix PostgreSQL ProFTPD Redis Squid stunnel Tomcat Traefik Mozilla Configuration Modern Services with clients that support TLS 1.3 and don't need backward compatibility Intermediate General-purpose servers with a variety of clients, recommended for almost all systems Old Compatible with a number of very old clients, and should be used only as a last resort Environment Server Version OpenSSL Version Miscellaneous This also redirects to HTTPS, if possible javascript required Copy",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "HipKittens: Fast and furious AMD kernels",
      "url": "https://hazyresearch.stanford.edu/blog/2025-11-09-hk",
      "score": 220,
      "source": "Hacker News",
      "content": "Nov 11, 2025 · 8 min read HipKittens: Fast and Furious AMD Kernels William Hu , Drew Wadsworth , Chris Ré , Simran Arora Team : William Hu, Drew Wadsworth, Sean Siddens, Stanley Winata, Daniel Fu, Ryan Swann, Muhammad Osama, Christopher Ré, Simran Arora Links : Arxiv | Code AI is gated by hardware. We think that opening up AI’s compute landscape is one of the most important problems to be working on right now. Building towards this goal, we present HipKittens: SoTA AMD kernels and a collection of opinionated programming primitives to make AMD kernel dev easier! Named after AMD's CUDA equivalent, called HIP . Building towards multi-silicon AI systems While AI has largely used a single hardware vendor to get to its current stage, AMD GPU hardware now offers state-of-the-art peak compute and memory bandwidth. However, this performance is locked away from AI workflows due to the lack of mature AMD software. Spec NVIDIA B200 SXM5 AMD MI355X OAM BF16 matrix / tensor 2.2 PFLOPs 2.5 PFLOPs MXFP8 matrix / tensor 4.5 PFLOPs 5.0 PFLOPs MXFP6 matrix / tensor 4.5 PFLOPs 10.1 PFLOPs MXFP4 matrix / tensor 9.0 PFLOPs 10.1 PFLOPs Memory capacity 180 GB 288 GB Memory bandwidth 8.0 TB/s 8.0 TB/s Table 1: Hardware overview. Peak memory and compute speeds for the latest generation GPU platforms. The AMD software ecosystem includes AITER , a high performance AI kernel library; PyTorch and a few compilers ( Triton , Mojo , TileLang ); and Composable Kernel (CK) , AMD's C++ based programming model for writing kernels. However, despite gigawatt-scale AMD deployments , the software remains brittle. The existing software offerings fail to consistently achieve peak performance. CK kernels frequently underperform (see our evaluations below). AITER and PyTorch are volatile; for instance, AITER and PyTorch SDPA Llama GQA backwards kernels achieve just 30% and 24% of SoTA performance respectively on AMD MI355X GPUs. And the compilers currently significantly sacrifice performance and have not yet d\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    }
  ],
  "topics": {
    "AI/ML": [
      "AI World Clocks"
    ],
    "Programming": [
      "A new Google model is nearly perfect on automated handwriting recognition",
      "Go's Sweet 16"
    ],
    "Open Source": [
      "'No One Lives Forever' turns 25 and you still can't buy it legitimately"
    ]
  },
  "total_stories": 14,
  "security_validated": true,
  "version": "2.0",
  "parsing_stats": {
    "total_input": 14,
    "accepted": 13,
    "rejected": 1,
    "acceptance_rate": 0.9285714285714286,
    "rejected_titles": [
      {
        "title": "Our investigation into the suspicious pressure on Archive.today",
        "reason": "Failed quality assessment"
      }
    ]
  },
  "parsed_version": "1.0"
}