{
  "timestamp": "2025-11-12T06:38:11.674330+00:00",
  "source": "Hacker News",
  "learnings": [
    {
      "title": "X5.1 solar flare, G4 geomagnetic storm watch",
      "url": "https://www.spaceweatherlive.com/en/news/view/593/20251111-x5-1-solar-flare-g4-geomagnetic-storm-watch.html",
      "score": 274,
      "source": "Hacker News",
      "content": "SpaceWeatherLive\n.com\nReal-time auroral and solar activity\nX5.1 solar flare, G4 geomagnetic storm watch\nTuesday, 11 November 2025 19:07 UTC\nHere she blows! Sunspot region 4274 produced its strongest solar flare thus far since it appeared on the east limb and the sixth strongest solar flare of the current solar cycle. An impressive long duration and highly eruptive X5.1 (R3-strong) solar flare peaked this morning at 10:04 UTC.\nIt became quickly clear that the eruption would be followed by an impressive coronal mass ejection (CME). The resulting coronal wave following the solar explosion as well as the coronal dimming observed as the CME was propelled into space were of a spectacular magnitude as can be seen in the animation below provided by\nhalocme\n.\nAnother eruption from AR12474, associated with an X5.1 flare. It has become a full halo CME. I am truly impressed by how fast and global this coronal wave is. The CME will arrive on November 13, but because of earlier CMEs it will be challenging to isolate the ICME from this.\npic.twitter.com/H6eNjzQUGz\n— Halo CME (@halocme)\nNovember 11, 2025\nTaking a look at coronagraph imagery provided by GOES-19 CCOR-1 we see the gorgeous fast halo coronal mass ejection as it propagates away from the Sun. It doesn't take a rocket scientist to come to the conclusion that this plasma cloud of course has an earth-directed component and it is pretty clear that this will be a strong impact when it arrives at our planet. This rightfully so prompted the NOAA SWPC to issue a G4 or greater geomagnetic storm watch for tomorrow as the cloud could impact our planet as early as 16 UTC on 12 November. Not only is the CME fast but it will also travel trough an area with high ambient solar wind speed and low density thanks to two other CMEs released earlier by this region. More about that below.\nCoronal mass ejection launched during today's X5.1 solar flare as captured by the coronagraph from GOES-19.\nIf the solar wind and interplanetary magnetic fie\n\n[Content truncated...]"
    },
    {
      "title": "Laptops with Stickers",
      "url": "https://stickertop.art/main/",
      "score": 290,
      "source": "Hacker News",
      "content": "Main\nJack\nAug 18, 2025\n•\n12 min read\nWelcome to stickertop.art\nDiscover a unique collection of laptops adorned with creative stickers from around the world.\nThis project celebrates the art and culture of laptop personalization each laptop tells a story through its stickers and gives us a glimpse of the personality of the owners."
    },
    {
      "title": "Perkeep – Personal storage system for life",
      "url": "https://perkeep.org/",
      "score": 106,
      "source": "Hacker News",
      "content": "Home\nDownload\nDocs\nCode\nCommunity\nPerkeep lets you\npermanently keep\nyour stuff, for life.\nPerkeep (\nnée Camlistore\n) is a set of open source formats, protocols, and software for modeling, storing, searching, sharing and synchronizing data in the post-PC era. Data may be files or objects, tweets or 5TB videos, and you can access it via a phone, browser or FUSE filesystem.\nPerkeep is under active development. If you're a programmer or fairly technical, you can probably get it up and running and get some utility out of it. Many bits and pieces are actively being developed, so be prepared for bugs and unfinished features.\nJoin\nthe community\n, consider\ncontributing\n, or\nfile a bug\n.\nThings Perkeep believes:\nYour data is entirely under your control\nOpen Source\nParanoid about privacy, everything private by default\nNo SPOF: don't rely on any single party (including yourself)\nYour data should be alive in 80 years, especially if you are\nLatest Release\nThe latest release is\n0.12 (\"Toronto\")\n, released 2025-11-11.\nFollow the\ndownload and getting started instructions\nto set up Perkeep.\nVideo Demo\nLinuxFest Northwest 2018 [\nslides\n] [\nvideo\n]:\nOr see the\nother presentations\n.\nWebsite layout inspired by\nmemcached\n.\nContent by\nthe authors\n."
    },
    {
      "title": ".NET MAUI is coming to Linux and the browser",
      "url": "https://avaloniaui.net/blog/net-maui-is-coming-to-linux-and-the-browser-powered-by-avalonia",
      "score": 153,
      "source": "Hacker News",
      "content": "We are bringing .NET MAUI to Linux and to the browser, powered by Avalonia.\nFor the past few months, we have been working on an Avalonia powered backend for .NET MAUI, with guidance and feedback from engineers in the MAUI ecosystem. What started as an experiment has grown into a project we are committing to, with apps already running on new platforms. It is time to show you what we have been building.\nTry It Right Now\nBefore we dive into the details, you can experience it yourself:\nLaunch MAUI in your browser â\u0086\u0092\nThis is a real MAUI application running on WebAssembly, rendered through Avalonia, with no plugins or hidden tricks. It is an early build with rough edges, but it proves the point: MAUI can now run on every major desktop OS and in the browser.\nWhat is the Avalonia MAUI Backend?\nAt its core, the Avalonia MAUI Backend enables you to keep your MAUI codebase while replacing the rendering layer with Avalonia. The goal is straightforward: take your existing MAUI applications and extend them to additional platforms, while enhancing desktop performance along the way.\nIn practical terms, that means several big wins.\nDesktop Linux support\n.NET MAUI apps running as first class desktop apps on distributions such as Ubuntu, Debian and Fedora, sharing the same Avalonia renderer that already powers demanding desktop apps in production today.\nEmbedded Linux\nAvalonia already runs on embedded Linux devices, from Raspberry Pi panels to industrial HMIs. Using the same backend, the Avalonia MAUI Backend brings those capabilities to MAUI as well, so the applications you build in MAUI can run on the same embedded Linux targets as Avalonia.\nWebAssembly support\nThe demo you can open in your browser today is a real MAUI application running on WebAssembly, rendered by Avalonia, with no native dependencies on the client. It is an early build, but it demonstrates what is now possible. MAUI apps will soon be free to deploy to the browser.\nBonus: The Avalonia MAUI Backend runs on Windows\n\n[Content truncated...]"
    },
    {
      "title": "I didn't reverse-engineer the protocol for my blood pressure monitor in 24 hours",
      "url": "https://james.belchamber.com/articles/blood-pressure-monitor-reverse-engineering/",
      "score": 181,
      "source": "Hacker News",
      "content": "I didn't reverse-engineer the protocol for my blood pressure monitor in 24 hours\nTue Nov 11 2025\nYesterday after receiving my yearly flu vaccine at the pharmacy I was offered a blood pressure test, which reported a reading that made the young pharmacist who had just given me my vaccine a bit worried.\nOff the back of this she offered me a 24 hour study, and then strapped a cuff to my arm plumbed into a little device which I had to wear in a little caddy - the cuff would inflate every 30 minutes during the day and every 60 minutes during the night, and then tomorrow I would bring it back for analysis.\n\"Can I read the measurements?\" I asked, as it was being strapped to me.\n\"Oh, no, that will just stress you out. We turn that off\". Fair enough.\nThing is, this device had a little micro-USB port on the side.\nA blood pressure monitor with a flap being held back, revealing a micro-USB port\nDoing things the proper way\nI had started researching the device - a\nMicrolife WatchBP O3\n- before I got out of the chemist, and once I'd got back to the office I downloaded\nthe software\nthat's freely available to interact with it, setting up a Bottles instance to run the software since I don't (knowingly) have a Windows machine within 100 metres of me.\nInstalling WatchBP Analyzer in Bottles\nUnfortunately it didn't seem to be able to access the device, and I had no clue why. In Linux it was just presenting as a standard\nhidraw\ndevice:\n[33301.736724] hid-generic 0003:04D9:B554.001E: hiddev96,hidraw1: USB HID v1.11 Device [USB HID UART Bridge] on usb-0000:c5:00.0-1/input0\nFine\n, I'll install windows.\nMicrosoft wants my diagnostic data\nAfter dodging around Microsoft's idea of UX, and then forwarding the USB device to the VM (I used\nGnome Boxes\nfor this, works nicely), I finally got to see WatchBP Analyzer with the data downloaded from the device.\nWatchBP Analyzer with my first three measurements\nBut I don't want to open a Virtual Machine running Windows to see this data, and anyway - I'm pre\n\n[Content truncated...]"
    },
    {
      "title": "Four strange places to see London's Roman Wall",
      "url": "https://diamondgeezer.blogspot.com/2025/11/odd-places-to-see-londons-roman-wall.html",
      "score": 115,
      "source": "Hacker News",
      "content": "diamond geezer\nTuesday, November 11, 2025\nThere are\nmany\nplaces\naround the City of London to see its old\nRoman Wall\n, notably alongside Noble Street, in Barber Surgeons' Meadow, through the Barbican, in St Alphage Garden and just outside the entrance to Tower Hill station. Here are four of the odder spots.\nFour strange places to see London's Roman Wall\n1) From platform 1 at Tower Hill station\nIf you're ever waiting for a westbound train at Tower Hill station, take a walk to the rear of the platform and take a look across the tracks, roughly where the penultimate carriage would stop. High on the far wall is a square recess lined by black tiles, and at the back of that is a dimly-lit surface of chunky irregular blocks. Unlike every single other thing on the Underground, the Romans built that.\nLondon's original wall was 2 miles long, 6 metres high and almost 3 metres thick at its base, all the better to keep out uncivilised marauders. It was built around 200 AD, then left to decay and rebuilt in the medieval era, again for defensive purposes. This is one of the original bits, not that you can easily tell by squinting across the tracks. A small metal lamp points inwards but is no longer switched on because heritage illumination is not a TfL priority. There is however a rather nice silver plaque on the pillar opposite, should you step back far enough to notice it.\nThe plaque confirms that the stones here are a continuation of the wall seen (much more clearly) outside. What it doesn't mention is the unavoidable truth that the wall must once have continued across the tracks and platforms but is no longer here. That's because when the Circle line was constructed in 1882 the railway companies had permission to demolish 22 metres of London's wall and duly did, the Victorians never being afraid to destroy ancient heritage.\nIan Visits\nhas a photo of navvies standing atop the offending stonework just before they bashed it through. The square hole is no recompense, plus you can't\n\n[Content truncated...]"
    },
    {
      "title": "The terminal of the future",
      "url": "https://jyn.dev/the-terminal-of-the-future",
      "score": 164,
      "source": "Hacker News",
      "content": "the terminal of the future\n2025-11-11\n•\nideas\n•\nterminal\nTable of contents\na mental model of a terminal\nwhat does a better terminal look like?\na first try: Jupyter\nsome problems\nhow does that work?\nshell integration\nlong-lived processes\ninteracting\nsuspending\ndisconnecting\nrerun and undo/redo\nderived features\nneeds a Jupyter notebook frontend\nneeds shell integration\nneeds sandboxed tracing\nok but how do you build this\nstage 1: transactional semantics\nstage 2: persistent sessions\nstage 3: structured RPC\nstage 4: jupyter-like frontend\njyn, what the fuck\nbibliography\nThis post is part 6 of a multi-part series called\n“the computer of the next 200 years”\n.\nTerminal internals are a mess. A lot of it is just the way it is because someone made a decision in the 80s and now it’s impossible to change.\n—\nJulia Evans\nThis is what you have to do to redesign infrastructure. Rich [Hickey] didn't just pile some crap on top of Lisp [when building Clojure]. He took the entire Lisp and moved the whole design at once.\n—\nGary Bernhardt\na mental model of a terminal\nAt a very very high level, a terminal has four parts:\nThe \"\nterminal emulator\n\", which is a program that renders a grid-like structure to your graphical display.\nThe \"\npseudo-terminal\n\" (PTY), which is a connection between the terminal emulator and a \"process group\" which receives input. This is not a program. This is a piece of state in the kernel.\nThe \"shell\", which is a program that leads the \"process group\", reads and parses input, spawns processes, and generally acts as an event loop. Most environments use\nbash\nas the default shell.\nThe programs spawned by your shell, which interact with all of the above in order to receive input and send output.\nI lied a little bit above. \"input\" is not just text. It also includes\nsignals\nthat can be sent to the running process. Converting keystrokes to signals is the job of the PTY.\nSimilar, \"output\" is not just text. It's a stream of\nANSI Escape Sequences\nthat can be used by the termin\n\n[Content truncated...]"
    },
    {
      "title": "Pikaday: A friendly guide to front-end date pickers",
      "url": "https://pikaday.dbushell.com",
      "score": 182,
      "source": "Hacker News",
      "content": "Who needs a JavaScript date picker?\nThe answer, in most cases, is nobody!\nComplex UI leads to more errors and abandoned forms.\nThere can be easier ways to pick a date than a calendar widget.\nThis guide provides alternate ideas and aims to send developers on a path towards\nuser-friendly interfaces\n.\nNative date and time inputs\nIf you absolutely must use a calendar widget then itâ\u0080\u0099s wise to use the native input.\nAll modern\nbrowsers support\nnative date and time inputs.\nDate input\nDate\nThe\ndate\ninput type\nprovides a native date picker.\nTime input\nTime\nThe\ntime\ninput type\nallows users to specify hours and minutes.\nDatetime input\nDate and time\nThe\ndatetime-local\ninput type\ncombines both date and time.\nWhy use native inputs\nNative inputs are super easy to implement with one line of code. The web browser handles many important details for developers:\nAccessibility\n(mostly*)\nPerformance\nInternationalisation\nLet browsers do the hard work!\nBrowsers allow keyboard users to type numbers in sequence.\nMost browsers provide alternate UI for time and date selection like the classic calendar widget.\nThey're not perfect but do you trust a JavaScript library to do better?\n*\nOh dear!\nEven native date pickers have some\naccessibility issues\n.\nWho disables JavaScript?\nHTML elements require no JavaScript.\nEvery script is a performance burden and presents an opportunity for a website to break.\nAlthough most users do not actively disable JavaScript there are\nmany reasons JavaScript wonâ\u0080\u0099t be available\n.\nAlways consider\nprogressive enhancement\nto ensure\nJavaScript is not a hard requirement.\nSeparate inputs\nA single date picker can be tricky to operate. For memorable dates using separate inputs can improve usability.\nThe example below is based on\nGOV.UK date input component\n.\nWhen was your passport issued?\nFor example, 27 3 2007\nDay\nMonth\nYear\nSelect elements\nIf only a limited set of data is valid then using\nselect elements\nmay be suitable.\nThey can require fewer interactions to use and they \n\n[Content truncated...]"
    },
    {
      "title": "A modern 35mm film scanner for home",
      "url": "https://www.soke.engineering/",
      "score": 176,
      "source": "Hacker News"
    },
    {
      "title": "The history of Casio watches",
      "url": "https://www.casio.com/us/watches/50th/Heritage/1970s/",
      "score": 203,
      "source": "Hacker News"
    },
    {
      "title": "FFmpeg to Google: Fund us or stop sending bugs",
      "url": "https://thenewstack.io/ffmpeg-to-google-fund-us-or-stop-sending-bugs/",
      "score": 743,
      "source": "Hacker News",
      "content": "TNS\nOK\nSUBSCRIBE\nJoin our community of software engineering leaders and aspirational developers. Always\nstay in-the-know by getting the most important news and exclusive content delivered\nfresh to your inbox to learn more about at-scale software development.\nEMAIL ADDRESS\nREQUIRED\nSUBSCRIBE\nRESUBSCRIPTION REQUIRED\nIt seems that you've previously unsubscribed from our newsletter\nin the past. Click the button below to open the re-subscribe form\nin a new tab. When you're done, simply close that tab and continue\nwith this form to complete your subscription.\nRE-SUBSCRIBE\nThe New Stack does not sell your information or share it with\nunaffiliated third parties. By continuing, you agree to our\nTerms of Use\nand\nPrivacy Policy\n.\nWelcome and thank you for joining The New Stack community!\nPlease answer a few simple questions to help us deliver the news and resources you are interested in.\nFIRST NAME\nREQUIRED\nLAST NAME\nREQUIRED\nCOMPANY NAME\nREQUIRED\nCOUNTRY\nREQUIRED\nSelect ...\nUnited States\nCanada\nIndia\nUnited Kingdom\nGermany\nFrance\n---\nAfghanistan\nAlbania\nAlgeria\nAmerican Samoa\nAndorra\nAngola\nAnguilla\nAntarctica\nAntigua and Barbuda\nArgentina\nArmenia\nAruba\nAsia/Pacific Region\nAustralia\nAustria\nAzerbaijan\nBahamas\nBahrain\nBangladesh\nBarbados\nBelarus\nBelgium\nBelize\nBenin\nBermuda\nBhutan\nBolivia\nBonaire, Sint Eustatius and Saba\nBosnia and Herzegovina\nBotswana\nBouvet Island\nBrazil\nBritish Indian Ocean Territory\nBrunei Darussalam\nBulgaria\nBurkina Faso\nBurundi\nCambodia\nCameroon\nCanada\nCape Verde\nCayman Islands\nCentral African Republic\nChad\nChile\nChina\nChristmas Island\nCocos (Keeling) Islands\nColombia\nComoros\nCongo\nCongo, The Democratic Republic of the\nCook Islands\nCosta Rica\nCroatia\nCuba\nCuraçao\nCyprus\nCzech Republic\nCôte d'Ivoire\nDenmark\nDjibouti\nDominica\nDominican Republic\nEcuador\nEgypt\nEl Salvador\nEquatorial Guinea\nEritrea\nEstonia\nEthiopia\nFalkland Islands (Malvinas)\nFaroe Islands\nFiji\nFinland\nFrance\nFrench Guiana\nFrench Polynesia\nFrench Southern Territories\nGabon\nGambia\nGeorgia\nGerm\n\n[Content truncated...]"
    },
    {
      "title": "My fan worked fine, so I gave it WiFi",
      "url": "https://ellis.codes/blog/my-fan-worked-fine-so-i-gave-it-wi-fi/",
      "score": 156,
      "source": "Hacker News",
      "content": "My Fan Worked Fine, So I Gave it WiFi\n3 November 2025\nI designed a fully revertible modification for a Vornado 633DC fan so I could control it remotely over WiFi. The final result is concealed entirely within the fan’s housing, leaving no visible modification.\nIf you’re interested in building one yourself, the schematic,\nBoM\n, and\nPCB\ndesign are all available\nhere\n. In terms of firmware, I used\nESPHome\nwith an external component, for which the source code is available\nhere\n. The rest of this post covers the research and development that went into the project.\nThe underside of the modified fan, boasting a larger, more advanced PCB than the original.\nHow it began\nWhen I first bought this fan I chose it because it uses a DC motor which, compared to AC counterparts, use less power, and run quieter. By adding a smart plug between it and a power outlet, I could give it a basic form of on/off remote control. But this presented a problem: If I wanted to adjust the speed I would have to physically interact with the fan!\nObviously, I needed to see what could be done about this, and so I took a look at the inside of the fan. Six screws later, and I was greeted with a surprisingly spacious interior.\nInside were two components:\nAn AC-DC converter\nA small PCB which held the potentiometer used for the speed control dial\nEverything joined up via a 2-pin and 5-pin connector on the PCB. From there, it was a straightforward matter of measuring voltages and continuity to work out what connected to what: the 2-pin connector was offering 24V DC. The 5-pin connector was what went off to the motor itself. Two of its pins were passing through the 24V DC and ground directly. Two more pins were connected to the potentiometer. The fifth pin was not connected.\nWith this, I concluded that the variable resistance between the two potentiometer pins is used to control the speed of the motor. From here the idea started to form: if I could produce a variable resistance digitally, I could control it r\n\n[Content truncated...]"
    },
    {
      "title": "Scaling HNSWs",
      "url": "https://antirez.com/news/156",
      "score": 173,
      "source": "Hacker News",
      "content": "Scaling HNSWs"
    },
    {
      "title": "We ran over 600 image generations to compare AI image models",
      "url": "https://latenitesoft.com/blog/evaluating-frontier-ai-image-generation-models/",
      "score": 133,
      "source": "Hacker News",
      "content": "Blog\nWe ran over 600 image generations to compare AI models\ntl:dr;\nWe’ve been making photo apps for iOS for long enough that we have gray hairs now, and using our experience we ran over 600 image generations to compare which AI models work best for which image edits. If you want, you can jump right to the\nimage comparisons\n, or the\nconclusion\n, but promise us you won’t presumptuous comments on Hacker News until you’ve also read the background!\nBackground\nHi! We’re LateNiteSoft, and we’ve been working on photography-related iOS apps for 15 years now. Working on market-leading apps such as Camera+,\nPhoton\nand\nREC\n, we’ve always had our finger on the pulse on what users want out of their mobile photography.\nWith the ground-breaking release of OpenAI’s\ngpt-image-1\nimage generation model earlier this year, we started investigating all the interesting use cases we could think of for AI image editing.\nBut as a company that has never taken any venture capital investment, all our products have to pay for themselves. We’re in it to delight our users, not just capture market share and sell them out. When considering AI projects, one thing has been clear – we can’t take the AI startup road where you have a generous free tier, charge an unreasonably small monthly fee for “unlimited”, and hope you’re going to make it up on scale (code for “someone please acquire us”).\nAll the AI-focused billing systems we could find out there were based on this. Assuming you want to claim unlimited access, and then sandbag users with “fair use” clauses and prevent them from any actual unlimited usage (which is, obviously, untenable, since you’ll end up with one $20/mo user reselling to everyone else).\nSince we want to fairly charge our customers for what they actually use, we’ve built a credit-based “pay per generation”-style billing system (that internally we’ve been calling CreditProxy). We’ve also been planning on providing this as a service, since nobody else seems to be doing it, so if you’r\n\n[Content truncated...]"
    },
    {
      "title": "The Department of War just shot the accountants and opted for speed",
      "url": "https://steveblank.com/2025/11/11/the-department-of-war-just-shot-the-accountants-and-opted-for-speed/",
      "score": 165,
      "source": "Hacker News",
      "content": "Home\nAbout Steve\nStartup Books\nSlides/Videos\nFund Raising\nTools!\nSecret History\nSteve Blank\nEntries\nRSS\n|\nComments RSS\nEmail Subscription\nEnter your email address to subscribe to this blog and receive notifications of new posts by email.\nEmail Address\nSign me up!\nJoin 55.9K other subscribers\nCategories\n2 Minute Lessons\n(15)\nAir Force\n(20)\nArdent\n(9)\nBusiness Model versus Business Plan\n(64)\nCalifornia Coastal Commission\n(9)\nChina\n(9)\nCommencement Speeches\n(9)\nConservation\n(4)\nConvergent Technologies\n(4)\nCorporate/Gov't Innovation\n(133)\nCovid-19/Recovery\n(10)\nCustomer Development\n(328)\nCustomer Development Manifesto\n(34)\nE.piphany\n(13)\nEducators Summit\n(7)\nESL\n(8)\nFamily/Career/Culture\n(84)\nGordian Knot Center for National Security Innovation\n(13)\nHacking For Defense\n(44)\nHacking for Diplomacy\n(10)\nHacking for Recovery\n(5)\nHarvard Business Review\n(12)\nInnovation Doctrine\n(3)\nInnovation Outposts\n(4)\nInvestment Readiness Level\n(6)\nLean LaunchPad\n(118)\nLife Sciences (NIH)\n(26)\nMarket Types\n(15)\nMarketing\n(27)\nMIPS Computers\n(2)\nNational Security\n(44)\nNavy\n(7)\nNIH (National Institutes of Health)\n(18)\nNSF (National Science Foundation)\n(19)\nRocket Science Games\n(10)\nScience and Industrial Policy\n(29)\nSecret History of Silicon Valley\n(26)\nSiriusXM Radio Show\n(50)\nSuperMac\n(12)\nTeaching\n(179)\nTechnology\n(86)\nTechnology Innovation and Great Power Competition\n(18)\nTechnology Innovation and Modern War\n(21)\nTesla\n(5)\nUncategorized\n(8)\nVenture Capital\n(85)\nVertical Markets\n(5)\nZilog\n(5)\nGet Steve Blank via your RSS Feed\nRSS - Posts\nRSS - Comments\nRecent Posts\nThe Department of War Just Shot the Accountants and Opted for Speed\nIt only took 20 years, but the Strategic Management Society now Believes the Lean Startup is a Strategy\nHow to Sell to the Dept of War – The 2025 PEO Directory – Now with 500 more names\nNo Science, No Startups: The Innovation Engine We’re Switching Off\nWhen Sh!t Hits the Fan – Founders in a Crisis\nHow To Sell to the Dept of War – The 2025 PEO Directory\nBlind \n\n[Content truncated...]"
    },
    {
      "title": "iPhone Pocket",
      "url": "https://www.apple.com/newsroom/2025/11/introducing-iphone-pocket-a-beautiful-way-to-wear-and-carry-iphone/",
      "score": 475,
      "source": "Hacker News",
      "content": "UPDATE\nNovember 11, 2025\nIntroducing iPhone Pocket: a beautiful way to wear and carry iPhone\nBorn out of a collaboration between ISSEY MIYAKE and Apple, iPhone Pocket features a singular 3D-knitted construction designed to fit any iPhone\niPhone Pocket, born out of a collaboration between ISSEY MIYAKE and Apple, will be available at select Apple Store locations beginning Friday, November 14.\nISSEY MIYAKE and Apple today unveiled\niPhone Pocket\n. Inspired by the concept of “a piece of cloth,” its singular 3D-knitted construction is designed to fit any iPhone as well as all pocketable items. Beginning Friday, November 14, it will be available at select Apple Store locations and on\napple.com\nin France, Greater China, Italy, Japan, Singapore, South Korea, the UK, and the U.S.\niPhone Pocket features a ribbed open structure with the qualities of the original pleats by ISSEY MIYAKE. Born from the idea of creating an additional pocket, its understated design fully encloses iPhone, expanding to fit more of a user’s everyday items. When stretched, the open textile subtly reveals its contents and allows users to peek at their iPhone display. iPhone Pocket can be worn in a variety of ways — handheld, tied onto bags, or worn directly on the body. Featuring a playful color palette, the short strap design is available in eight colors, and the long strap design in three colors.\nFeaturing a playful color palette, the short strap design is available in eight colors: lemon, mandarin, purple, pink, peacock, sapphire, cinnamon, and black.\nThe long strap design is available in three colors: sapphire, cinnamon, and black.\n“The design of iPhone Pocket speaks to the bond between iPhone and its user, while keeping in mind that an Apple product is designed to be universal in aesthetic and versatile in use,” shared Yoshiyuki Miyamae, design director of MIYAKE DESIGN STUDIO. “iPhone Pocket explores the concept of ‘the joy of wearing iPhone in your own way.’ The simplicity of its design echoes wha\n\n[Content truncated...]"
    },
    {
      "title": "Collaboration sucks",
      "url": "https://newsletter.posthog.com/p/collaboration-sucks",
      "score": 368,
      "source": "Hacker News",
      "content": "Collaboration sucks\nBe the driver\nCharles Cook\nNov 11, 2025\n50\n12\n2\nShare\n“If you want to go fast, go alone; if you want to go far, go together”\nThis phrase will slowly kill your company and I’m here to prove it.\nImagine you are driving a car. It’s often useful to have someone give you directions, point out gas stations, and recommend stops for snacks. This is a helpful amount of collaboration.\nAn unhelpful amount of collaboration is getting out of your car to ask pedestrians if they like your car, swapping drivers every 10 minutes, or having someone constantly commenting on your driving.\nIn the first scenario, you get the right amount of feedback to get to your destination as fast as possible. In the second, you get more feedback, but it slows you down. You run the risk of not making it to the place you want to go.\nThe second scenario is also the one most startups (or companies, really) end up in because of ✨ collaboration ✨.\nBeing good at feedback means knowing when not to give it\nAs PostHog grows, I’ve seen more and more collaboration that doesn’t add value or adds far too little value for the time lost collaborating. So much so we made “collaboration sucks” the topic of the week during a recent company all hands.\n“You’re the driver” is a\nkey value\nfor us at PostHog. We aim to hire people who are great at their jobs and get out of their way. No deadlines, minimal coordination, and no managers telling you what to do.\nIn return, we ask for extraordinarily high ownership and the ability to get a lot done by\nyourself.\nMarketers ship code, salespeople answer technical questions without backup, and\nproduct engineers\nwork across the stack.\nThis means there is almost always someone better at what you are doing than you are. It is tempting to get them, or anybody really, involved and ✨ collaborate ✨, but collaboration forces the driver to slow down and explain stuff (background, context, their thinking).\nThis tendency reveals itself in a few key phrases:\n“Curious what X t\n\n[Content truncated...]"
    }
  ],
  "topics": {
    "Web": [
      ".NET MAUI is coming to Linux and the browser"
    ],
    "Programming": [
      "FFmpeg to Google: Fund us or stop sending bugs"
    ],
    "AI/ML": [
      "We ran over 600 image generations to compare AI image models"
    ],
    "Performance": [
      "The Department of War just shot the accountants and opted for speed"
    ]
  },
  "total_stories": 17
}