{
  "timestamp": "2025-11-13T13:27:11.735189+00:00",
  "source": "Hacker News",
  "learnings": [
    {
      "title": "Checkout.com hacked, refuses ransom payment, donates to security labs",
      "url": "https://www.checkout.com/blog/protecting-our-merchants-standing-up-to-extortion",
      "score": 200,
      "source": "Hacker News",
      "content": "Sign in Get in touch Resource center Search Text Link Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Topic Region Perspectives Protecting our Merchants: Standing up to Extortion Our statement detailing an incident concerning a legacy system. We outline our commitment to transparency, accountability, and planned investment in cyber security research. Link to the author's page Mariano Albera November 12, 2025 Link to the author's page What’s inside Link Share on social media Facebook Social Share Button Twitter Social Share Button Linkedin Social Share Button Email Share Button Copied! Categories Company News Tl;dr: Last week, we were targeted by a criminal extortion attempt. The attackers gained access to a legacy, third-party cloud file storage system. Our live payment processing platform was not impacted. No merchant funds or card numbers were accessed. We are donating the ransom amount to fund cybercrime research. Last week, Checkout.com was contacted by a criminal group known as “ShinyHunters”, who claimed to have obtained data connected to Checkout.com and demanded a ransom. Upon investigation, we determined that this data was obtained by gaining unauthorized access to a legacy third-party cloud file storage system, used in 2020 and prior years. We estimate that this would affect less than 25% of our current merchant base. The system was used for internal operational documents and merchant onboarding materials at that time. This incident has not impacted our payment processing platform. The threat actors do not have, and never had, access to merchant funds or card numbers. The episode occurred when threat actors gained access to this third party legacy system which was not decommissioned properly. This was our mistake, and we take full responsibility. We are sorry. We regret that this incident has caused worry for our partners and people. We have begun the process to identify and contact those impacted and are\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Google will allow users to sideload Android apps without verification",
      "url": "https://android-developers.googleblog.com/2025/11/android-developer-verification-early.html",
      "score": 1127,
      "source": "Hacker News",
      "content": "☰ Android Developers Blog The latest Android and Google Play news for app and game developers. 🔍 Android Developers → Jetpack Kotlin Docs News Platform Android Studio Google Play Jetpack Kotlin Docs News Platform Android Studio Google Play Jetpack Kotlin Docs News More | 12 November 2025 Android developer verification: Early access starts now as we continue to build with your feedback Share this post LinkedIn Twitter Facebook Email Copy link Link copied to clipboard Posted by Matthew Forsythe Director - Product Management, Android App Safety We recently announced new developer verification requirements, which serve as an additional layer of defense in our ongoing effort to keep Android users safe. We know that security works best when it accounts for the diverse ways people use our tools. This is why we announced this change early: to gather input and ensure our solutions are balanced. We appreciate the community's engagement and have heard the early feedback – specifically from students and hobbyists who need an accessible path to learn, and from power users who are more comfortable with security risks. We are making changes to address the needs of both groups. To understand how these updates fit into our broader mission, it is important to first look at the specific threats we are tackling. Why verification is important Keeping users safe on Android is our top priority. Combating scams and digital fraud is not new for us — it has been a central focus of our work for years. From Scam Detection in Google Messages to Google Play Protect and real-time alerts for scam calls, we have consistently acted to keep our ecosystem safe . However, online scams and malware campaigns are becoming more aggressive. At the global scale of Android, this translates to real harm for people around the world – especially in rapidly digitizing regions where many are coming online for the first time. Technical safeguards are critical, but they cannot solve for every scenario where a user i\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Steam Machine",
      "url": "https://store.steampowered.com/sale/steammachine",
      "score": 2245,
      "source": "Hacker News",
      "content": "Login Store Home Discovery Queue Wishlist Points Shop News Stats Community Home Discussions Workshop Market Broadcasts About Support Change language Get the Steam Mobile App View desktop website © Valve Corporation. All rights reserved. All trademarks are property of their respective owners in the US and other countries. Privacy Policy | Legal | Accessibility | Steam Subscriber Agreement | Refunds STORE Home Discovery Queue Wishlist Points Shop News Stats COMMUNITY Home Discussions Workshop Market Broadcasts About SUPPORT Install Steam login | language 简体中文 (Simplified Chinese) 繁體中文 (Traditional Chinese) 日本語 (Japanese) 한국어 (Korean) ไทย (Thai) Български (Bulgarian) Čeština (Czech) Dansk (Danish) Deutsch (German) Español - España (Spanish - Spain) Español - Latinoamérica (Spanish - Latin America) Ελληνικά (Greek) Français (French) Italiano (Italian) Bahasa Indonesia (Indonesian) Magyar (Hungarian) Nederlands (Dutch) Norsk (Norwegian) Polski (Polish) Português (Portuguese - Portugal) Português - Brasil (Portuguese - Brazil) Română (Romanian) Русский (Russian) Suomi (Finnish) Svenska (Swedish) Türkçe (Turkish) Tiếng Việt (Vietnamese) Українська (Ukrainian) Report a translation problem © 2025 Valve Corporation. All rights reserved. All trademarks are property of their respective owners in the US and other countries. VAT included in all prices where applicable. Privacy Policy | Legal | Accessibility | Steam Subscriber Agreement | Refunds | Cookies View mobile website About Valve | Jobs | Steamworks | Steam Distribution | Support | Recycling | Gift Cards | | |",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Steam Frame",
      "url": "https://store.steampowered.com/sale/steamframe",
      "score": 1623,
      "source": "Hacker News",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Android 16 QPR1 is being pushed to the Android Open Source Project",
      "url": "https://grapheneos.social/@GrapheneOS/115533432439509433",
      "score": 164,
      "source": "Hacker News",
      "content": "To use the Mastodon web application, please enable JavaScript. Alternatively, try one of the native apps for Mastodon for your platform.",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "The last-ever penny will be minted today in Philadelphia",
      "url": "https://www.cnn.com/2025/11/12/business/last-penny-minted",
      "score": 698,
      "source": "Hacker News",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Human Fovea Detector",
      "url": "https://www.shadertoy.com/view/4dsXzM",
      "score": 262,
      "source": "Hacker News",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Homebrew no longer allows bypassing Gatekeeper for unsigned/unnotarized software",
      "url": "https://github.com/Homebrew/brew/issues/20755",
      "score": 251,
      "source": "Hacker News",
      "content": "Homebrew / brew Public Uh oh! There was an error while loading. Please reload this page . Notifications You must be signed in to change notification settings Fork 10.7k Star 45.4k Removing support for --no-quarantine for casks #20755 New issue Copy link New issue Copy link Closed Feature #20973 Closed Removing support for --no-quarantine for casks #20755 Feature #20973 Copy link Description p-linnane opened on Sep 23, 2025 Issue body actions Verification This issue's title and/or description do not reference a single formula e.g. brew install wget . If they do, open an issue at https://github.com/Homebrew/homebrew-core/issues/new/choose instead. Provide a detailed description of the proposed feature --no-quarantine is used to forcibly bypass Gatekeeper, which is a built-in macOS security mechanism. This is used to run unsigned/unnotarized applications. macOS Tahoe is the final release to support Intel systems, and last year Apple updated macOS runtime protection to make it harder to override Gatekeeper. Macs with Apple silicon also don't \" permit native arm64 code to execute unless a valid signature is attached \". Finally, we are ending support for all casks that fail Gatekeeper checks on September 1st, 2026. With the above in mind, it's time to deprecate the --no-quarantine flag from brew . It intentionally bypasses macOS security mechanisms, which we already actively discourage. Deprecating now will give a decent lead time for users using it to come up with another solution or adjust their workflows. What is the motivation for the feature? Intel support is coming to an end from both Apple and Homebrew. This flag is primarily used to override a macOS security mechanism, which we do not want to encourage. Since we are requiring casks fulfill Gatekeeper checks next year, there is no reason to keep this flag. How will the feature be relevant to at least 90% of Homebrew users? We will provide a safer experience for our users, and stop making it easier to bypass OS-leve\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "GPT-5.1: A smarter, more conversational ChatGPT",
      "url": "https://openai.com/index/gpt-5-1/",
      "score": 413,
      "source": "Hacker News",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Project Euler",
      "url": "https://projecteuler.net",
      "score": 483,
      "source": "Hacker News",
      "content": "About Project Euler What is Project Euler? Project Euler is a series of challenging mathematical/computer programming problems that will require more than just mathematical insights to solve. Although mathematics will help you arrive at elegant and efficient methods, the use of a computer and programming skills will be required to solve most problems. The motivation for starting Project Euler, and its continuation, is to provide a platform for the inquiring mind to delve into unfamiliar areas and learn new concepts in a fun and recreational context. Who are the problems aimed at? The intended audience include students for whom the basic curriculum is not feeding their hunger to learn, adults whose background was not primarily mathematics but had an interest in things mathematical, and professionals who want to keep their problem solving and mathematics on the cutting edge. Currently we have 1365127 registered members who have solved at least one problem, representing 220 locations throughout the world, and collectively using 113 different programming languages to solve the problems. Can anyone solve the problems? The problems range in difficulty and for many the experience is inductive chain learning. That is, by solving one problem it will expose you to a new concept that may allow you to undertake a previously inaccessible problem. So determined participants will be able to slowly but surely work their way through the problems. What next? In order to track your progress it is necessary to setup an account and have Cookies enabled. If you already have an account, then Sign In . Otherwise, please Register – it's completely free! However, as the problems are challenging, you may wish to view the Problems before registering. \"Project Euler exists to encourage, challenge, and develop the skills and enjoyment of anyone with an interest in the fascinating world of mathematics.\" Project Euler: Copyright Information | Privacy Policy The page has been left unattended for to\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Mergiraf: Syntax-Aware Merging for Git",
      "url": "https://lwn.net/SubscriberLink/1042355/434ad706cc594276/",
      "score": 118,
      "source": "Hacker News",
      "content": "LWN .net News from the source Content Weekly Edition Archives Search Kernel Security Events calendar Unread comments LWN FAQ Write for us Edition Return to the Front page User: Password: | | Subscribe / Log in / New account Mergiraf: syntax-aware merging for Git By Daroc Alden October 31, 2025 The idea of automatic syntax-aware merging in version-control systems goes back to 2005 or earlier , but initial implementations were often language-specific and slow. Mergiraf is a merge-conflict resolver that uses a generic algorithm plus a small amount of language-specific knowledge to solve conflicts that Git's default strategy cannot. The project's contributors have been working on the tool for just under a year, but it already supports 33 languages , including C, Python, Rust, and even SystemVerilog . Mergiraf was started by Antonin Delpeuch, but several other contributors have stepped up to help, of which Ada Alakbarova is the most prolific. The project is written in Rust and licensed under version 3 of the GPL. The default Git merge algorithm (\"ort\") is primarily line-based. It does include some tree-based logic for merging directories, but changes within a single file are merged on a line-by-line basis. That can lead to situations where two logically separate changes that affect the same line cause a merge conflict. Consider the following base version: void callback(int status); And then suppose that one person makes the function fallible: int callback(int status); While someone else changes the argument type: void callback(long status); The default merge algorithm can't handle that, because there are conflicting changes to the same line. Syntax-aware merging, however, is based on the syntactical elements of the language, not individual lines. So, for example, Mergiraf can resolve the above conflict like this: int callback(long status); From its point of view, the changes don't actually overlap, because the return type and the argument type are treated as separate, no\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Valve is about to win the console generation",
      "url": "https://xeiaso.net/blog/2025/valve-is-about-to-win-the-console-generation/",
      "score": 401,
      "source": "Hacker News",
      "content": "Making sure you're not a bot! Loading... Please wait a moment while we ensure the security of your connection.",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Fighting the New York Times' invasion of user privacy",
      "url": "https://openai.com/index/fighting-nyt-user-privacy-invasion",
      "score": 367,
      "source": "Hacker News",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Marble: A Multimodal World Model",
      "url": "https://www.worldlabs.ai/blog/marble-world-model",
      "score": 230,
      "source": "Hacker News",
      "content": "November 12, 2025 Marble, our frontier multimodal world model, is available to everyone starting today Marble: A Multimodal World Model Spatial intelligence is the next frontier in AI, demanding powerful world models to realize its full potential. World models should reconstruct, generate, and simulate 3D worlds; and allow both humans and agents to interact with them. Spatially intelligent world models will transform a wide variety of industries over the coming years. Two months ago we shared a preview of Marble , our World Model that creates 3D worlds from image or text prompts. Since then, Marble has been available to an early set of beta users to create 3D worlds for themselves. Today we are making Marble, a first-in-class generative multimodal world model, generally available for anyone to use. We have also drastically expanded Marble's capabilities, and are excited to highlight them here: Multimodal Marble : Marble is now massively multimodal. Marble can create 3D worlds from text, images, video, or coarse 3D layouts; Marble also lets you interactively edit, expand, and combine worlds. Once generated, 3D worlds can be exported as Gaussian splats, meshes, or videos. These new capabilities let users create and edit worlds with fine-grained control; and makes those worlds more useful than ever before. Marble Labs : We are launching Marble Labs , a creative hub where imagination meets experimentation. It is where artists, engineers, and designers push the boundaries of world models, showcasing bold ideas, real-world workflows, and new possibilities across gaming, VFX, design, robotics, and beyond. Marble Labs is also home to in-depth case studies, tutorials, and documentation that give anyone the tools to learn, build, and share their own 3D worlds. Sign up at marble.worldlabs.ai and start creating worlds for yourself! The Marble World Model Our human experience of the world is inherently multimodal: we use all of our senses to make sense of the world around us. We\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "GLP-1 drugs linked to lower death rates in colon cancer patients",
      "url": "https://today.ucsd.edu/story/glp-1-drugs-linked-to-dramatically-lower-death-rates-in-colon-cancer-patients",
      "score": 173,
      "source": "Hacker News",
      "content": "Research Alerts More Research Alerts GLP-1 Drugs Linked to Dramatically Lower Death Rates in Colon Cancer Patients Colon cancer patients taking GLP-1 medications were less than half as likely to die within five years compared to those who weren’t on the drugs (15.5% vs. 37.1%) Story by: Lizelda Lopez - llopez2@ucsd.edu Published Date November 11, 2025 Story by: Lizelda Lopez - llopez2@ucsd.edu Topics covered: Colon Cancer GLP-1 Medication Share This: Article Content A new University of California San Diego study offers compelling evidence that GLP-1 receptor agonists — the class of drugs behind Ozempic, Wegovy and Mounjaro, for example — may do more than regulate blood sugar and weight. In an analysis of more than 6,800 colon cancer patients across all University of California Health sites, researchers found that those taking glucagon-like peptide-1 (GLP-1) medications were less than half as likely to die within five years compared to those who weren’t on the drugs (15.5% vs. 37.1%). The study, led by Raphael Cuomo , Ph.D., associate professor in the Department of Anesthesiology at UC San Diego School of Medicine and member of UC San Diego Moores Cancer Center, used real-world clinical data from the University of California Health Data Warehouse to assess outcomes across the state’s academic medical centers. After adjusting for age, body mass index (BMI), disease severity and other health factors, GLP-1 users still showed significantly lower odds of death, suggesting a strong and independent protective effect. The survival benefit appeared most pronounced in patients with very high BMI (over 35), hinting that GLP-1 drugs may help counteract the inflammatory and metabolic conditions that worsen colon cancer prognosis. Researchers believe several biological mechanisms could explain the link. Beyond regulating blood sugar, GLP-1 receptor agonists reduce systemic inflammation, improve insulin sensitivity and promote weight loss — all factors that can dampen tumor-promot\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Learn Prolog Now",
      "url": "https://lpn.swi-prolog.org/lpnpage.php?pageid=top",
      "score": 304,
      "source": "Hacker News",
      "content": "This version of Learn Prolog Now! embeds SWI SH , SWI-Prolog for SHaring. The current version rewrites the Learn Prolog Now! HTML on the fly, recognising source code and example queries. It is not yet good at recognising the relations between source code fragments and queries. Also Learn Prolog Now! needs some updating to be more compatible with SWI-Prolog. All sources are on GitHub: LearnPrologNow LPN SWISH Proxy SWISH Learn Prolog Now! by Patrick Blackburn , Johan Bos , and Kristina Striegnitz > LPN! Home Free Online Version Paperback English Paperback Français Teaching Prolog Prolog Implementations Prolog Manuals Prolog Links Thanks! Contact us Tweets by @learnprolognow Learn Prolog Now! is an introductory course to programming in Prolog . The online version has been available since 2001, and now there is also a throughly revised version available in book form . We wanted to do two things with this course. First, we wanted to provide a text that was relatively self contained, a text that would permit someone with little or no knowledge of computing to pick up the basics of Prolog with the minimum of fuss. We also wanted the text to be clear enough to make it useful for self study. We believe that if you read the text, and do the associated exercises, you will gain a useful partial entry to the world of Prolog. But only a partial entry, and this brings us to our second point. We want to emphasize the practical aspects of Prolog. Prolog is something you do. You can't learn a programming language simply by reading about it, and if you really want to get the most out of this course, we strongly advise you to get hold of a Prolog interpreter (you'll find pointers to some nice ones on this website) and work through all the Practical Sessions that we provide. And of course, don't stop with what we provide. The more you program, the better you'll get.... We hope you enjoy the course. And whether you're using this book to teach yourself Prolog, or you're using it as the b\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Yt-dlp: External JavaScript runtime now required for full YouTube support",
      "url": "https://github.com/yt-dlp/yt-dlp/issues/15012",
      "score": 1003,
      "source": "Hacker News",
      "content": "yt-dlp / yt-dlp Public Uh oh! There was an error while loading. Please reload this page . Notifications You must be signed in to change notification settings Fork 10.8k Star 135k [Announcement] External JavaScript runtime now required for full YouTube support #15012 New issue Copy link New issue Copy link Open Open [Announcement] External JavaScript runtime now required for full YouTube support #15012 Copy link Labels discussion/announcement Description bashonly opened on Nov 12, 2025 Issue body actions This is a follow-up to #14404 , which announced that yt-dlp will soon require an external JavaScript runtime (e.g. Deno) in order to fully support downloading from YouTube. With the release of yt-dlp version 2025.11.12 , external JavaScript runtime support has arrived. All users who intend to use yt-dlp with YouTube are strongly encouraged to install one of the supported JS runtimes. The following JavaScript runtimes are currently supported ( in order of recommendation, from strongest to weakest ): Deno recommended for most users https://deno.com/ https://github.com/denoland/deno note: if downloading from Deno's GitHub releases , get deno not denort minimum Deno version supported by yt-dlp: 2.0.0 the latest version of Deno is strongly recommended Node https://nodejs.org/ minimum Node version supported by yt-dlp: 20.0.0 if using Node, the latest version (25+) is strongly recommended for security reasons QuickJS https://bellard.org/quickjs/ minimum QuickJS version supported by yt-dlp: 2023-12-9 if using QuickJS, version 2025-4-26 or later is strongly recommended for performance reasons QuickJS-ng https://quickjs-ng.github.io/quickjs/ all versions are supported by yt-dlp; however, upstream QuickJS is recommended instead for performance reasons Bun https://bun.com/ minimum Bun version supported by yt-dlp: 1.0.31 if using Bun, the latest version is strongly recommended Note that only deno is enabled by default; all others are disabled by default for security reasons. See \n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Digital ID, a new way to create and present an ID in Apple Wallet",
      "url": "https://www.apple.com/newsroom/2025/11/apple-introduces-digital-id-a-new-way-to-create-and-present-an-id-in-apple-wallet/",
      "score": 125,
      "source": "Hacker News",
      "content": "UPDATE November 12, 2025 Apple introduces Digital ID, a new way to create and present an ID in Apple Wallet Digital ID offers a secure and private way for users to create an ID in Apple Wallet using information from their U.S. passport, and present their ID with iPhone or Apple Watch Available today, Digital ID is a new way for users to create an ID in Apple Wallet using information from their U.S. passport, and present it with the security and privacy of iPhone or Apple Watch. Apple today announced the launch of Digital ID, a new way for users to create an ID in Apple Wallet using information from their U.S. passport, and present it with the security and privacy of iPhone or Apple Watch. At launch, Digital ID acceptance will roll out first in beta at TSA checkpoints at more than 250 airports in the U.S. for in-person identity verification during domestic travel, with additional Digital ID acceptance use cases to come in the future. Digital ID gives more people a way to create and present an ID in Apple Wallet even if they do not have a REAL ID-compliant driver’s license or state ID. Digital ID is not a replacement for a physical passport, and cannot be used for international travel and border crossing in lieu of a U.S. passport. “With the launch of Digital ID, we’re excited to expand the ways users can store and present their identity — all with the security and privacy built into iPhone and Apple Watch,” said Jennifer Bailey, Apple’s vice president of Apple Pay and Apple Wallet. “Since introducing the ability to add a driver’s license or state ID to Apple Wallet in 2022, we’ve seen how much users love having their ID right on their devices. Digital IDs brings this secure and convenient option to even more users across the country, as they can now add an ID to Wallet using information from their U.S. passport.” The launch follows the capability for users to add an eligible driver’s license and state ID to Apple Wallet. If users do not have a U.S. passport to create\n\n[Content truncated...]",
      "quality_score": 1.0,
      "quality_issues": [
        "High quality content"
      ],
      "parsed": true
    },
    {
      "title": "Launch HN: JSX Tool (YC F25) – A Browser Dev-Panel IDE for React",
      "url": "",
      "score": 103,
      "source": "Hacker News",
      "quality_score": 0.9,
      "quality_issues": [
        "No URL provided"
      ],
      "parsed": true
    }
  ],
  "topics": {
    "Security": [
      "Checkout.com hacked, refuses ransom payment, donates to security labs"
    ],
    "Programming": [
      "Google will allow users to sideload Android apps without verification",
      "Yt-dlp: External JavaScript runtime now required for full YouTube support"
    ],
    "Open Source": [
      "Android 16 QPR1 is being pushed to the Android Open Source Project",
      "Mergiraf: Syntax-Aware Merging for Git",
      "Digital ID, a new way to create and present an ID in Apple Wallet"
    ],
    "AI/ML": [
      "GPT-5.1: A smarter, more conversational ChatGPT"
    ],
    "Web": [
      "Launch HN: JSX Tool (YC F25) – A Browser Dev-Panel IDE for React"
    ]
  },
  "total_stories": 20,
  "security_validated": true,
  "version": "2.0",
  "parsing_stats": {
    "total_input": 20,
    "accepted": 19,
    "rejected": 1,
    "acceptance_rate": 0.95,
    "rejected_titles": [
      {
        "title": "Helm 4.0",
        "reason": "Failed quality assessment"
      }
    ]
  },
  "parsed_version": "1.0"
}