{
  "timestamp": "2025-11-12T13:27:42.391694+00:00",
  "source": "Hacker News",
  "learnings": [
    {
      "title": "Yann LeCun to depart Meta and launch AI startup focused on 'world models'",
      "url": "https://www.nasdaq.com/articles/metas-chief-ai-scientist-yann-lecun-depart-and-launch-ai-start-focused-world-models",
      "score": 426,
      "source": "Hacker News",
      "content": "AAPL TSLA AMZN META AMD NVDA PEP COST ADBE GOOG AMGN HON INTC INTU NFLX ADP SBUX MRNA AAPL TSLA AMZN META AMD NVDA PEP COST ADBE GOOG AMGN HON INTC INTU NFLX ADP SBUX MRNA AAPL TSLA AMZN META AMD NVDA PEP COST ADBE GOOG AMGN HON INTC INTU NFLX ADP SBUX MRNA Markets META Meta's Chief AI Scientist Yann LeCun To Depart And Launch AI Start-Up Focused On 'World Models' November 11, 2025 — 04:42 pm EST Written by RTTNews.com for RTTNews -> (RTTNews) - Meta's (META) chief artificial intelligence scientist, Yann LeCun, plans to leave the company to launch his own AI start-up, marking a major shift inside Meta as CEO Mark Zuckerberg doubles down on \"superintelligence\" initiatives to compete with OpenAI and Google, according to people familiar with the matter. LeCun, a Turing Award-winning pioneer of modern AI, has begun early fundraising discussions for his new venture, which will focus on developing \"world models,\" next-generation systems designed to learn from visual and spatial data rather than text. These models aim to replicate human reasoning and understanding of the physical world, a project LeCun has said could take a decade to mature. LeCun's exit comes amid an internal overhaul of Meta's AI strategy. Zuckerberg has shifted Meta's Fundamental AI Research Lab - FAIR, which LeCun founded in 2013, away from long-term research toward commercial AI products and large language models - LLMs. The move follows the underwhelming release of Meta's Llama 4 model, which lagged behind rival offerings from Anthropic, Google, and OpenAI. To accelerate progress, Zuckerberg recently hired Alexandr Wang, founder of Scale AI, paying $14.3 billion for a 49 percent stake in his company and appointing him to lead Meta's new Superintelligence division, to which LeCun now reports. The CEO also formed an elite team called TBD Lab, offering $100 million pay packages to lure top AI talent from competitors. LeCun has publicly disagreed with Zuckerberg's heavy reliance on LLMs, calling them \"us\n\n[Content truncated...]"
    },
    {
      "title": "Yt-dlp: External JavaScript runtime now required for full YouTube support",
      "url": "https://github.com/yt-dlp/yt-dlp/issues/15012",
      "score": 133,
      "source": "Hacker News",
      "content": "yt-dlp / yt-dlp Public Uh oh! There was an error while loading. Please reload this page . Notifications You must be signed in to change notification settings Fork 10.8k Star 135k [Announcement] External JavaScript runtime now required for full YouTube support #15012 New issue Copy link New issue Copy link Open Open [Announcement] External JavaScript runtime now required for full YouTube support #15012 Copy link Labels discussion/announcement Description bashonly opened on Nov 12, 2025 Issue body actions This is a follow-up to #14404 , which announced that yt-dlp will soon require an external JavaScript runtime (e.g. Deno) in order to fully support downloading from YouTube. With the release of yt-dlp version 2025.11.12 , external JavaScript runtime support has arrived. All users who intend to use yt-dlp with YouTube are strongly encouraged to install one of the supported JS runtimes. The following JavaScript runtimes are currently supported ( in order of recommendation, from strongest to weakest ): Deno recommended for most users https://deno.com/ https://github.com/denoland/deno note: if downloading from Deno's GitHub releases , get deno not denort minimum Deno version supported by yt-dlp: 2.0.0 the latest version of Deno is strongly recommended Node https://nodejs.org/ minimum Node version supported by yt-dlp: 20.0.0 if using Node, the latest version (25+) is strongly recommended for security reasons QuickJS https://bellard.org/quickjs/ minimum QuickJS version supported by yt-dlp: 2023-12-9 if using QuickJS, version 2025-4-26 or later is strongly recommended for performance reasons QuickJS-ng https://quickjs-ng.github.io/quickjs/ all versions are supported by yt-dlp; however, upstream QuickJS is recommended instead for performance reasons Bun https://bun.com/ minimum Bun version supported by yt-dlp: 1.0.31 if using Bun, the latest version is strongly recommended Note that only deno is enabled by default; all others are disabled by default for security reasons. See \n\n[Content truncated...]"
    },
    {
      "title": "Please donate to keep Network Time Protocol up – Goal 1k",
      "url": "https://www.ntp.org/",
      "score": 163,
      "source": "Hacker News",
      "content": "Show Your Support by Donating Today! 2025 Goal: $395 of $1,000 Welcome to the home of the Network Time Protocol (NTP) Project. The NTP Project conducts Research and Development in NTP, a protocol designed to synchronize the clocks of computers over a network to a common timebase. NTP is what ensures the reliability of billions of devices around the world, under the sea, and even in space. Accurate timekeeping is vital to the many applications which have revolutionized and are essential to our daily lives: satellites, GPS, 5G, financial services, healthcare, and more. The NTP Project produces an open source Reference Implementation of the NTP standard, maintains the implementation Documentation , and develops the protocol and algorithmic standard that is used to communicate time between systems. Background information about NTP can be found in the Reference Library . Network Time Foundation provides support for the NTP Project. Learn more about the Foundation’s work . Network Time Foundation hosts monthly virtual online fundraising events. Each event highlights a time-related topic. Limited tickets available. Get yours today! Details and Registration Download NTP Report a Bug"
    },
    {
      "title": "Pakistani newspaper mistakenly prints AI prompt with the article",
      "url": "https://twitter.com/omar_quraishi/status/1988518627859951986",
      "score": 122,
      "source": "Hacker News",
      "content": "JavaScript is not available. We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using x.com. You can see a list of supported browsers in our Help Center. Help Center Terms of Service Privacy Policy Cookie Policy Imprint Ads info © 2025 X Corp. Something went wrong, but don’t fret — let’s give it another shot. Try again Some privacy related extensions may cause issues on x.com. Please disable them and try again."
    },
    {
      "title": "Laptops with Stickers",
      "url": "https://stickertop.art/main/",
      "score": 475,
      "source": "Hacker News",
      "content": "Main Jack Aug 18, 2025 • 12 min read Welcome to stickertop.art Discover a unique collection of laptops adorned with creative stickers from around the world. This project celebrates the art and culture of laptop personalization each laptop tells a story through its stickers and gives us a glimpse of the personality of the owners."
    },
    {
      "title": "X5.1 solar flare, G4 geomagnetic storm watch",
      "url": "https://www.spaceweatherlive.com/en/news/view/593/20251111-x5-1-solar-flare-g4-geomagnetic-storm-watch.html",
      "score": 352,
      "source": "Hacker News",
      "content": "X5.1 solar flare, G4 geomagnetic storm watch Tuesday, 11 November 2025 19:07 UTC Here she blows! Sunspot region 4274 produced its strongest solar flare thus far since it appeared on the east limb and the sixth strongest solar flare of the current solar cycle. An impressive long duration and highly eruptive X5.1 (R3-strong) solar flare peaked this morning at 10:04 UTC. It became quickly clear that the eruption would be followed by an impressive coronal mass ejection (CME). The resulting coronal wave following the solar explosion as well as the coronal dimming observed as the CME was propelled into space were of a spectacular magnitude as can be seen in the animation below provided by halocme . Another eruption from AR12474, associated with an X5.1 flare. It has become a full halo CME. I am truly impressed by how fast and global this coronal wave is. The CME will arrive on November 13, but because of earlier CMEs it will be challenging to isolate the ICME from this. pic.twitter.com/H6eNjzQUGz — Halo CME (@halocme) November 11, 2025 Taking a look at coronagraph imagery provided by GOES-19 CCOR-1 we see the gorgeous fast halo coronal mass ejection as it propagates away from the Sun. It doesn't take a rocket scientist to come to the conclusion that this plasma cloud of course has an earth-directed component and it is pretty clear that this will be a strong impact when it arrives at our planet. This rightfully so prompted the NOAA SWPC to issue a G4 or greater geomagnetic storm watch for tomorrow as the cloud could impact our planet as early as 16 UTC on 12 November. Not only is the CME fast but it will also travel trough an area with high ambient solar wind speed and low density thanks to two other CMEs released earlier by this region. More about that below. Coronal mass ejection launched during today's X5.1 solar flare as captured by the coronagraph from GOES-19. If the solar wind and interplanetary magnetic field values at Earth are favorable this could result in a geo\n\n[Content truncated...]"
    },
    {
      "title": "I didn't reverse-engineer the protocol for my blood pressure monitor in 24 hours",
      "url": "https://james.belchamber.com/articles/blood-pressure-monitor-reverse-engineering/",
      "score": 270,
      "source": "Hacker News",
      "content": "I didn't reverse-engineer the protocol for my blood pressure monitor in 24 hours Tue Nov 11 2025 Yesterday after receiving my yearly flu vaccine at the pharmacy I was offered a blood pressure test, which reported a reading that made the young pharmacist who had just given me my vaccine a bit worried. Off the back of this she offered me a 24 hour study, and then strapped a cuff to my arm plumbed into a little device which I had to wear in a little caddy - the cuff would inflate every 30 minutes during the day and every 60 minutes during the night, and then tomorrow I would bring it back for analysis. \"Can I read the measurements?\" I asked, as it was being strapped to me. \"Oh, no, that will just stress you out. We turn that off\". Fair enough. Thing is, this device had a little micro-USB port on the side. A blood pressure monitor with a flap being held back, revealing a micro-USB port Doing things the proper way I had started researching the device - a Microlife WatchBP O3 - before I got out of the chemist, and once I'd got back to the office I downloaded the software that's freely available to interact with it, setting up a Bottles instance to run the software since I don't (knowingly) have a Windows machine within 100 metres of me. Installing WatchBP Analyzer in Bottles Unfortunately it didn't seem to be able to access the device, and I had no clue why. In Linux it was just presenting as a standard hidraw device: [33301.736724] hid-generic 0003:04D9:B554.001E: hiddev96,hidraw1: USB HID v1.11 Device [USB HID UART Bridge] on usb-0000:c5:00.0-1/input0 Fine , I'll install windows. Microsoft wants my diagnostic data After dodging around Microsoft's idea of UX, and then forwarding the USB device to the VM (I used Gnome Boxes for this, works nicely), I finally got to see WatchBP Analyzer with the data downloaded from the device. WatchBP Analyzer with my first three measurements But I don't want to open a Virtual Machine running Windows to see this data, and anyway - I'm pre\n\n[Content truncated...]"
    },
    {
      "title": "Bluetooth 6.2 – more responsive, improves security, USB comms, and testing",
      "url": "https://www.cnx-software.com/2025/11/05/bluetooth-6-2-gets-more-responsive-improves-security-usb-communication-and-testing-capabilities/",
      "score": 145,
      "source": "Hacker News",
      "content": "Posted on November 5, 2025 November 5, 2025 by Jean-Luc Aufranc (CNXSoft) - 3 Comments on Bluetooth 6.2 gets more responsive, improves security, USB communication, and testing capabilities Bluetooth 6.2 gets more responsive, improves security, USB communication, and testing capabilities Bluetooth 6.2 specification has just been released with a range of new features to enhance responsiveness with shorter connection intervals, strengthen security against amplitude-based RF attacks, and improve communication with a new “Bulk Serialization Mode” that’s especially useful for USB Bluetooth LE audio applications. The new Bluetooth Core 6.2 specification also introduces various BLE Test Mode enhancements. If you feel like Bluetooth specifications are released more often than in the past, that’s normal because the Bluetooth SIG switched to a bi-annual release schedule. For instance, the Bluetooth 6.1 specification was just published last May, or about 6 months ago… Bluetooth 6.2 highlights: Bluetooth Shorter Connection Intervals (SCI) reduce the minimum Bluetooth LE connection interval from 7.5 ms to just 375 µs for faster responsiveness. The change will especially impact high-performance HID devices, real-time human-machine interfaces (HMIs), and latency-sensitive sensors. AR/VR and gaming applications will particularly benefit from the lower latency. Bluetooth Channel Sounding Amplitude-based Attack Resilience adds protections against sophisticated amplitude-based RF attacks. Devices for the automotive, smart home, and industrial markets will become less prone to relay and spoofing threats with the changes. Bluetooth HCI USB LE Isochronous Support gets Bulk Serialization Mode , a new mechanism for standardizing isochronous data transmission over USB. With this update, host-controller interface (HCI) packet handling will be simplified, and it also streamlines LE Audio integration in Bluetooth USB devices. Bluetooth LE Test Mode Enhancements enable a unified control protocol\n\n[Content truncated...]"
    },
    {
      "title": "Four strange places to see London's Roman Wall",
      "url": "https://diamondgeezer.blogspot.com/2025/11/odd-places-to-see-londons-roman-wall.html",
      "score": 197,
      "source": "Hacker News",
      "content": "diamond geezer Tuesday, November 11, 2025 There are many places around the City of London to see its old Roman Wall , notably alongside Noble Street, in Barber Surgeons' Meadow, through the Barbican, in St Alphage Garden and just outside the entrance to Tower Hill station. Here are four of the odder spots. Four strange places to see London's Roman Wall 1) From platform 1 at Tower Hill station If you're ever waiting for a westbound train at Tower Hill station, take a walk to the rear of the platform and take a look across the tracks, roughly where the penultimate carriage would stop. High on the far wall is a square recess lined by black tiles, and at the back of that is a dimly-lit surface of chunky irregular blocks. Unlike every single other thing on the Underground, the Romans built that. London's original wall was 2 miles long, 6 metres high and almost 3 metres thick at its base, all the better to keep out uncivilised marauders. It was built around 200 AD, then left to decay and rebuilt in the medieval era, again for defensive purposes. This is one of the original bits, not that you can easily tell by squinting across the tracks. A small metal lamp points inwards but is no longer switched on because heritage illumination is not a TfL priority. There is however a rather nice silver plaque on the pillar opposite, should you step back far enough to notice it. The plaque confirms that the stones here are a continuation of the wall seen (much more clearly) outside. What it doesn't mention is the unavoidable truth that the wall must once have continued across the tracks and platforms but is no longer here. That's because when the Circle line was constructed in 1882 the railway companies had permission to demolish 22 metres of London's wall and duly did, the Victorians never being afraid to destroy ancient heritage. Ian Visits has a photo of navvies standing atop the offending stonework just before they bashed it through. The square hole is no recompense, plus you can't\n\n[Content truncated...]"
    },
    {
      "title": ".NET MAUI is coming to Linux and the browser",
      "url": "https://avaloniaui.net/blog/net-maui-is-coming-to-linux-and-the-browser-powered-by-avalonia",
      "score": 238,
      "source": "Hacker News",
      "content": "We are bringing .NET MAUI to Linux and to the browser, powered by Avalonia. For the past few months, we have been working on an Avalonia powered backend for .NET MAUI, with guidance and feedback from engineers in the MAUI ecosystem. What started as an experiment has grown into a project we are committing to, with apps already running on new platforms. It is time to show you what we have been building. Try It Right Now Before we dive into the details, you can experience it yourself: Launch MAUI in your browser → This is a real MAUI application running on WebAssembly, rendered through Avalonia, with no plugins or hidden tricks. It is an early build with rough edges, but it proves the point: MAUI can now run on every major desktop OS and in the browser. What is the Avalonia MAUI Backend? At its core, the Avalonia MAUI Backend enables you to keep your MAUI codebase while replacing the rendering layer with Avalonia. The goal is straightforward: take your existing MAUI applications and extend them to additional platforms, while enhancing desktop performance along the way. In practical terms, that means several big wins. Desktop Linux support .NET MAUI apps running as first class desktop apps on distributions such as Ubuntu, Debian and Fedora, sharing the same Avalonia renderer that already powers demanding desktop apps in production today. Embedded Linux Avalonia already runs on embedded Linux devices, from Raspberry Pi panels to industrial HMIs. Using the same backend, the Avalonia MAUI Backend brings those capabilities to MAUI as well, so the applications you build in MAUI can run on the same embedded Linux targets as Avalonia. WebAssembly support The demo you can open in your browser today is a real MAUI application running on WebAssembly, rendered by Avalonia, with no native dependencies on the client. It is an early build, but it demonstrates what is now possible. MAUI apps will soon be free to deploy to the browser. Bonus: The Avalonia MAUI Backend runs on Windows a\n\n[Content truncated...]"
    },
    {
      "title": "Perkeep – Personal storage system for life",
      "url": "https://perkeep.org/",
      "score": 233,
      "source": "Hacker News",
      "content": "Home Download Docs Code Community Perkeep lets you permanently keep your stuff, for life. Perkeep ( née Camlistore ) is a set of open source formats, protocols, and software for modeling, storing, searching, sharing and synchronizing data in the post-PC era. Data may be files or objects, tweets or 5TB videos, and you can access it via a phone, browser or FUSE filesystem. Perkeep is under active development. If you're a programmer or fairly technical, you can probably get it up and running and get some utility out of it. Many bits and pieces are actively being developed, so be prepared for bugs and unfinished features. Join the community , consider contributing , or file a bug . Things Perkeep believes: Your data is entirely under your control Open Source Paranoid about privacy, everything private by default No SPOF: don't rely on any single party (including yourself) Your data should be alive in 80 years, especially if you are Latest Release The latest release is 0.12 (\"Toronto\") , released 2025-11-11. Follow the download and getting started instructions to set up Perkeep. Video Demo LinuxFest Northwest 2018 [ slides ] [ video ]: Or see the other presentations . Website layout inspired by memcached . Content by the authors ."
    },
    {
      "title": ".NET 10",
      "url": "https://devblogs.microsoft.com/dotnet/announcing-dotnet-10/",
      "score": 293,
      "source": "Hacker News",
      "content": "Today, we are excited to announce the launch of .NET 10, the most productive, modern, secure, intelligent, and performant release of .NET yet. It’s the result of another year of effort from thousands of developers around the world. This release includes thousands of performance, security, and functional improvements across the entire .NET stack-from languages and developer tools to workloads-enabling you to build with a unified platform and easily infuse your apps with AI. Important .NET 10 is a Long Term Support (LTS) release and will be supported for three years until November 10, 2028. We strongly recommend that production applications upgrade to .NET 10 to take advantage of the extended support window, significant performance improvements, and new capabilities. Downloads of .NET 10 and updates to Visual Studio 2026 and the C# Dev Kit for Visual Studio Code are available now. Download .NET 10 Get Visual Studio 2026 The .NET team, our partners, and the .NET community are showcasing what’s new in .NET 10 at .NET Conf 2025 . Watch the sessions to see all of the excitement including the keynote . A Thriving .NET Community .NET 10 wouldn’t be possible without our amazing community. Thank you to everyone who contributed issues, pull requests, code reviews, and feedback to make this release happen. The .NET ecosystem continues to flourish with over 478,000 packages on NuGet that have been downloaded over 800 billion times. Thousands of companies worldwide including H&R Block, Geocaching, Chipotle, Fidelity, and many more , along with products and services here at Microsoft like Xbox, Bing, Microsoft Graph, Azure Cosmos DB, Microsoft Exchange, Microsoft Teams, and Microsoft Copilot, trust .NET to build their most critical applications. Unparalleled Performance – Faster Apps, Lower Memory .NET 10 is the fastest .NET yet with improvements across the runtime, workloads, and languages. Stephen Toub’s performance improvements deep dive highlights the latest optimizations. Key\n\n[Content truncated...]"
    },
    {
      "title": "The terminal of the future",
      "url": "https://jyn.dev/the-terminal-of-the-future",
      "score": 246,
      "source": "Hacker News",
      "content": "the terminal of the future 2025-11-11 • ideas • terminal Table of contents a mental model of a terminal what does a better terminal look like? a first try: Jupyter some problems how does that work? shell integration long-lived processes interacting suspending disconnecting rerun and undo/redo derived features needs a Jupyter notebook frontend needs shell integration needs sandboxed tracing ok but how do you build this stage 1: transactional semantics stage 2: persistent sessions stage 3: structured RPC stage 4: jupyter-like frontend jyn, what the fuck bibliography This post is part 6 of a multi-part series called “the computer of the next 200 years” . Terminal internals are a mess. A lot of it is just the way it is because someone made a decision in the 80s and now it’s impossible to change. — Julia Evans This is what you have to do to redesign infrastructure. Rich [Hickey] didn't just pile some crap on top of Lisp [when building Clojure]. He took the entire Lisp and moved the whole design at once. — Gary Bernhardt a mental model of a terminal At a very very high level, a terminal has four parts: The \" terminal emulator \", which is a program that renders a grid-like structure to your graphical display. The \" pseudo-terminal \" (PTY), which is a connection between the terminal emulator and a \"process group\" which receives input. This is not a program. This is a piece of state in the kernel. The \"shell\", which is a program that leads the \"process group\", reads and parses input, spawns processes, and generally acts as an event loop. Most environments use bash as the default shell. The programs spawned by your shell, which interact with all of the above in order to receive input and send output. I lied a little bit above. \"input\" is not just text. It also includes signals that can be sent to the running process. Converting keystrokes to signals is the job of the PTY. Similar, \"output\" is not just text. It's a stream of ANSI Escape Sequences that can be used by the termin\n\n[Content truncated...]"
    },
    {
      "title": "Pikaday: A friendly guide to front-end date pickers",
      "url": "https://pikaday.dbushell.com",
      "score": 241,
      "source": "Hacker News",
      "content": "Who needs a JavaScript date picker? The answer, in most cases, is nobody! Complex UI leads to more errors and abandoned forms. There can be easier ways to pick a date than a calendar widget. This guide provides alternate ideas and aims to send developers on a path towards user-friendly interfaces . Native date and time inputs If you absolutely must use a calendar widget then it’s wise to use the native input. All modern browsers support native date and time inputs. Date input Date The date input type provides a native date picker. Time input Time The time input type allows users to specify hours and minutes. Datetime input Date and time The datetime-local input type combines both date and time. Why use native inputs Native inputs are super easy to implement with one line of code. The web browser handles many important details for developers: Accessibility (mostly*) Performance Internationalisation Let browsers do the hard work! Browsers allow keyboard users to type numbers in sequence. Most browsers provide alternate UI for time and date selection like the classic calendar widget. They're not perfect but do you trust a JavaScript library to do better? * Oh dear! Even native date pickers have some accessibility issues . Who disables JavaScript? HTML elements require no JavaScript. Every script is a performance burden and presents an opportunity for a website to break. Although most users do not actively disable JavaScript there are many reasons JavaScript won’t be available . Always consider progressive enhancement to ensure JavaScript is not a hard requirement. Separate inputs A single date picker can be tricky to operate. For memorable dates using separate inputs can improve usability. The example below is based on GOV.UK date input component . When was your passport issued? For example, 27 3 2007 Day Month Year Select elements If only a limited set of data is valid then using select elements may be suitable. They can require fewer interactions to use and they elim\n\n[Content truncated...]"
    },
    {
      "title": "The history of Casio watches",
      "url": "https://www.casio.com/us/watches/50th/Heritage/1970s/",
      "score": 265,
      "source": "Hacker News"
    },
    {
      "title": "A modern 35mm film scanner for home",
      "url": "https://www.soke.engineering/",
      "score": 218,
      "source": "Hacker News",
      "content": "Knokke The New Era of Film Scanning Knokke The New Era of Film Scanning Knokke - a high-resolution 35 mm film scanner built for photographers who demand speed, quality and control. Watch the video - Watch the video - Knokke The New Era of Film Scanning Knokke - a high-resolution 35 mm film scanner built for photographers who demand speed, quality, and control. Knokke redefines film scanning by bringing modern imaging, optics, and software into a beautifully engineered device. 4064 4064 DPI Resolution DPI Resolution 120 dB 120 dB Dynamic Range Dynamic Range 48-bit 48-bit True Color True Color Knokke - State-of-the-Art Hardware Knokke - State-of-the-Art Hardware Knokke - State-of-the-Art Hardware The modern 35 mm film scanner that captures a full roll in under just a few minutes while capturing every frame at 4064 DPI and 48bit colour. Its custom optics and state-of-the-art sensor deliver benchmark setting quality and speed at a price only Knokke can offer. Launch Updates Launch Updates Launch Updates A Modern Workflow A Modern Workflow A Modern Workflow Korova - Custom Software Korova - Custom Software Korova - Custom Software Built for the 21st century, Knokke runs on Korova, a lean C++ application that's native to Linux, macOS, and Windows—so you can forget vintage PCs and enjoy a plug-and-play workflow that lets you focus on your photos. Each frame can have custom scan settings, repeatable across multiple scans for consistent results and tailored workflows. The scanner can also skip directly to requested frames, massively accelerating scanning time and enabling fast access to key shots without unnecessary delay. Launch Updates Launch Updates Launch Updates Engineered for Individual Users and Lab Professionals 01 Quality Knokke’s premium build and precision engineering ensure lasting, reliable performance. 02 Speed Knokke’s high scan speed and streamlined workflow keep you moving. 03 Full Control Knokke lets you fine-tune every detail with flexible settings and pre\n\n[Content truncated...]"
    },
    {
      "title": "Why Nietzsche matters in the age of artificial intelligence",
      "url": "https://cacm.acm.org/blogcacm/why-nietzsche-matters-in-the-age-of-artificial-intelligence/",
      "score": 129,
      "source": "Hacker News"
    },
    {
      "title": "You will own nothing and be (un)happy",
      "url": "https://racc.blog/you-will-own-nothing-and-be-unhappy/",
      "score": 180,
      "source": "Hacker News",
      "content": "You will own nothing and be (un)happy 11 Nov, 2025 Yesterday, I checked out the Goodnotes app because I’m planning to buy an iPad to give note-taking on it a try again. I opened it and I saw that it has updated to Goodnotes 6. I looked through the changelogs, and what? There are AI-integrated features now, which, as far as I’m aware, can’t be turned off. 1 And the option to buy a lifetime license? Gone. I bought the previous “lifetime” version of the app, but for WHAT, since I have to pay for the subscription to access the newest features. Sure, I can switch back to the outdated version, but if I had known this would happen, I would’ve just gone for the yearly subscription (even though I try to avoid them). It would’ve been cheaper anyway. Sadly, everything is going in this direction. You can have a subscription for almost everything now. From food delivery apps to beer subscription. Companies prey on those who forget to cancel their free trial. So far, it only happened once to me, but thankfully, I managed to get my refund. But not everyone might feel like going through the refund process, because companies make it intentionally hard by creating friction - hiding it deep into their websites or adding extra unnecessary steps like forcing you to reach out to the support. People might just sigh, mutter “this bloody subscription rahhh,” and cancel it so it won’t charge them again. It’s funny how “ownership” in the digital world has become an illusion. You don’t really own your apps, your music, or even your tools anymore. You’re just renting access until someone decides to move the paywall. It’s convenient, sure, but it also feels like losing control over something that used to be ours. Market values steady revenue streams over fair ownership. The subscription model rewards companies not for making better products, but for finding better ways to keep us paying indefinitely. They won’t disappear, not unless they find something more profitable. Maybe they’ll start suckin\n\n[Content truncated...]"
    },
    {
      "title": "The Department of War just shot the accountants and opted for speed",
      "url": "https://steveblank.com/2025/11/11/the-department-of-war-just-shot-the-accountants-and-opted-for-speed/",
      "score": 214,
      "source": "Hacker News",
      "content": "Home About Steve Startup Books Slides/Videos Fund Raising Tools! Secret History Steve Blank Entries RSS | Comments RSS Email Subscription Enter your email address to subscribe to this blog and receive notifications of new posts by email. Email Address Sign me up! Join 55.9K other subscribers Categories 2 Minute Lessons (15) Air Force (20) Ardent (9) Business Model versus Business Plan (64) California Coastal Commission (9) China (9) Commencement Speeches (9) Conservation (4) Convergent Technologies (4) Corporate/Gov't Innovation (133) Covid-19/Recovery (10) Customer Development (328) Customer Development Manifesto (34) E.piphany (13) Educators Summit (7) ESL (8) Family/Career/Culture (84) Gordian Knot Center for National Security Innovation (13) Hacking For Defense (44) Hacking for Diplomacy (10) Hacking for Recovery (5) Harvard Business Review (12) Innovation Doctrine (3) Innovation Outposts (4) Investment Readiness Level (6) Lean LaunchPad (118) Life Sciences (NIH) (26) Market Types (15) Marketing (27) MIPS Computers (2) National Security (44) Navy (7) NIH (National Institutes of Health) (18) NSF (National Science Foundation) (19) Rocket Science Games (10) Science and Industrial Policy (29) Secret History of Silicon Valley (26) SiriusXM Radio Show (50) SuperMac (12) Teaching (179) Technology (86) Technology Innovation and Great Power Competition (18) Technology Innovation and Modern War (21) Tesla (5) Uncategorized (8) Venture Capital (85) Vertical Markets (5) Zilog (5) Get Steve Blank via your RSS Feed RSS - Posts RSS - Comments Recent Posts The Department of War Just Shot the Accountants and Opted for Speed It only took 20 years, but the Strategic Management Society now Believes the Lean Startup is a Strategy How to Sell to the Dept of War – The 2025 PEO Directory – Now with 500 more names No Science, No Startups: The Innovation Engine We’re Switching Off When Sh!t Hits the Fan – Founders in a Crisis How To Sell to the Dept of War – The 2025 PEO Directory Blind \n\n[Content truncated...]"
    },
    {
      "title": "FFmpeg to Google: Fund us or stop sending bugs",
      "url": "https://thenewstack.io/ffmpeg-to-google-fund-us-or-stop-sending-bugs/",
      "score": 964,
      "source": "Hacker News"
    },
    {
      "title": "My fan worked fine, so I gave it WiFi",
      "url": "https://ellis.codes/blog/my-fan-worked-fine-so-i-gave-it-wi-fi/",
      "score": 188,
      "source": "Hacker News",
      "content": "My Fan Worked Fine, So I Gave it WiFi 3 November 2025 I designed a fully revertible modification for a Vornado 633DC fan so I could control it remotely over WiFi. The final result is concealed entirely within the fan’s housing, leaving no visible modification. If you’re interested in building one yourself, the schematic, BoM , and PCB design are all available here . In terms of firmware, I used ESPHome with an external component, for which the source code is available here . The rest of this post covers the research and development that went into the project. The underside of the modified fan, boasting a larger, more advanced PCB than the original. How it began When I first bought this fan I chose it because it uses a DC motor which, compared to AC counterparts, use less power, and run quieter. By adding a smart plug between it and a power outlet, I could give it a basic form of on/off remote control. But this presented a problem: If I wanted to adjust the speed I would have to physically interact with the fan! Obviously, I needed to see what could be done about this, and so I took a look at the inside of the fan. Six screws later, and I was greeted with a surprisingly spacious interior. Inside were two components: An AC-DC converter A small PCB which held the potentiometer used for the speed control dial Everything joined up via a 2-pin and 5-pin connector on the PCB. From there, it was a straightforward matter of measuring voltages and continuity to work out what connected to what: the 2-pin connector was offering 24V DC. The 5-pin connector was what went off to the motor itself. Two of its pins were passing through the 24V DC and ground directly. Two more pins were connected to the potentiometer. The fifth pin was not connected. With this, I concluded that the variable resistance between the two potentiometer pins is used to control the speed of the motor. From here the idea started to form: if I could produce a variable resistance digitally, I could control it r\n\n[Content truncated...]"
    },
    {
      "title": "We ran over 600 image generations to compare AI image models",
      "url": "https://latenitesoft.com/blog/evaluating-frontier-ai-image-generation-models/",
      "score": 174,
      "source": "Hacker News",
      "content": "Blog We ran over 600 image generations to compare AI models tl:dr; We’ve been making photo apps for iOS for long enough that we have gray hairs now, and using our experience we ran over 600 image generations to compare which AI models work best for which image edits. If you want, you can jump right to the image comparisons , or the conclusion , but promise us you won’t presumptuous comments on Hacker News until you’ve also read the background! Background Hi! We’re LateNiteSoft, and we’ve been working on photography-related iOS apps for 15 years now. Working on market-leading apps such as Camera+, Photon and REC , we’ve always had our finger on the pulse on what users want out of their mobile photography. With the ground-breaking release of OpenAI’s gpt-image-1 image generation model earlier this year, we started investigating all the interesting use cases we could think of for AI image editing. But as a company that has never taken any venture capital investment, all our products have to pay for themselves. We’re in it to delight our users, not just capture market share and sell them out. When considering AI projects, one thing has been clear – we can’t take the AI startup road where you have a generous free tier, charge an unreasonably small monthly fee for “unlimited”, and hope you’re going to make it up on scale (code for “someone please acquire us”). All the AI-focused billing systems we could find out there were based on this. Assuming you want to claim unlimited access, and then sandbag users with “fair use” clauses and prevent them from any actual unlimited usage (which is, obviously, untenable, since you’ll end up with one $20/mo user reselling to everyone else). Since we want to fairly charge our customers for what they actually use, we’ve built a credit-based “pay per generation”-style billing system (that internally we’ve been calling CreditProxy). We’ve also been planning on providing this as a service, since nobody else seems to be doing it, so if you’r\n\n[Content truncated...]"
    },
    {
      "title": "Scaling HNSWs",
      "url": "https://antirez.com/news/156",
      "score": 198,
      "source": "Hacker News",
      "content": "Scaling HNSWs"
    }
  ],
  "topics": {
    "AI/ML": [
      "Yann LeCun to depart Meta and launch AI startup focused on 'world models'",
      "Pakistani newspaper mistakenly prints AI prompt with the article",
      "We ran over 600 image generations to compare AI image models"
    ],
    "Programming": [
      "Yt-dlp: External JavaScript runtime now required for full YouTube support",
      "Please donate to keep Network Time Protocol up – Goal 1k",
      "FFmpeg to Google: Fund us or stop sending bugs"
    ],
    "Security": [
      "Bluetooth 6.2 – more responsive, improves security, USB comms, and testing"
    ],
    "Web": [
      ".NET MAUI is coming to Linux and the browser"
    ],
    "Performance": [
      "The Department of War just shot the accountants and opted for speed"
    ]
  },
  "total_stories": 23,
  "security_validated": true,
  "version": "2.0"
}